app/controllers/phones_controller.rb

  def assign
    requested_number = assign_params["number"]
    if requested_number && !Phone.is_valid_number?(requested_number)
      render json: {errors: "Not Valid Number"} && return
    end

    new_number = requested_number ? Phone.parse_number_to_int(requested_number) : Phone.generate_random_number
    puts new_number
    phone = Phone.new(number: new_number)
    phone_stored = false
    while !phone_stored
      begin
        phone_stored = true if phone.save!
---
INSERT INTO "phones" ("created_at", "updated_at", "number") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2018-12-21 08:24:18.331096"], ["updated_at", "2018-12-21 08:24:18.331096"], ["number", 7000031137]]